{"Lunch/ Dinner":{"Appetizers":{"Seasonal Fried Green Tomatos":{"desc":"Served with onion-bacon jam and house-made remoulade","price":9,"new":false},"Crab Cakes":{"desc":"Fresh lump crab cakes served with house-made remoulade.","price":13,"new":false},"Deep Fried Mushrooms":{"desc":"Piled high! Hand-battered fresh mushrooms with horseradish sour cream.","price":9,"new":false},"Spinach & Artichoke Dip":{"desc":"Topped with fresh parmesan and mozzarella cheeses, diced tomatoes. Served with pita chips. Add Grilled Chicken for $3","price":10,"new":false},"Spicy Battered Pickle Fries":{"desc":"French fry-style sliced pickles, with sriracha ranch.","price":9,"new":false},"Onion Ring Tower":{"desc":"Sweet onions hand-cut, hand-battered, golden fried, with remoulade and cocktail sauce.","price":9,"new":false},"Homemade Fried Cheese":{"desc":"Choice of marinara or cocktail sauce.","price":10,"new":false},"Animal Spuds":{"desc":"Fried spuds, slow-roasted pork, spicy BBQ sauce, cheddar-jack cheese.","price":11,"new":false}},"Shareables":{"Napolean Dynamite":{"desc":"Grilled chicken quesadilla stuffed with black beans, corn, jalapeños and cheddar-jack cheeses. Served with salsa and sour cream.","price":11,"new":false},"G.O.A.T. Balls":{"desc":"Chefs’ house-made meatballs and marinara topped with goat cheese and chiffonade basil. Served with grilled crostinis.","price":13,"new":false},"Poutine":{"desc":"Fried spuds, Wisconsin cheese curds, braised short rib & gravy.","price":13,"new":false},"Margherita Flatbread Pizza":{"desc":"Fresh mozzarella, shredded mozzarella, roma tomatoes, garlic, chiffonade basil, sweet balsamic reduction.","price":13,"new":false},"Skillet Steamed Mussels":{"desc":"Sautéed in white wine, butter, fresh basil, tomatoes and garlic. Served with Cuban bread.","price":13,"new":false}},"Salads":{"Strawberry Chicken Spinach Salad":{"desc":"Fresh chopped spinach, grilled buttermilk chicken, applewood smoked bacon, fresh sliced strawberries, crumbled goat cheese, candied nuts, and served with our signature strawberry balsamic vinaigrette dressing.","price":14,"new":false},"Emma Lu Lu":{"desc":"Fresh chopped romaine, Caesar dressing, topped with grilled buttermilk chicken, applewood smoked bacon, garlic butter croûtons, Parmesan cheese, hard boiled egg.","price":14,"new":false},"Crispy Chicken BLT":{"desc":"Hand-breaded chicken breast, fresh mixed greens, diced fresh tomatoes, pickled onions and applewood smoked bacon, served with house-made buttermilk ranch.","price":14,"new":false},"Southwest Chicken Salad":{"desc":"Fresh chopped romaine, corn and black beans, house-made salsa, diced fresh tomatoes, cheddar-jack cheese topped with grilled buttermilk chicken, fresh fried tortilla strips, southwest ranch dressing.","price":14,"new":false},"Chef Salad":{"desc":"Fresh mixed greens, diced fresh tomatoes, hardwood smoked ham, mesquite turkey, applewood smoked bacon, cheddar-jack cheese, hard-boiled egg, served with house-made buttermilk ranch.","price":14,"new":false},"Trio Salad":{"desc":"Chicken salad, tuna salad and cottage cheese served with mixed greens and fresh fruit.","price":14,"new":true}},"Madison Pike Street Fare":{"Tacos De Pescado":{"desc":"Blackened or fried grouper strips served on warm tortillas with house-made salsa, fresh cabbage, cilantro lime crema, avocado slices. Served with lime wedge.","price":11,"new":false},"Sons of Zeus":{"desc":"Gyro meat, lettuce, onion, tomato and tzatziki sauce on grilled caramelized onion naan bread.","price":11,"new":false},"Joe Nuxhalls":{"desc":"Angus beef sliders, cheddar cheese, bacon, steak sauce aioli and pickle served with fried spuds.","price":13,"new":false},"Hacksaw Jim Duggans":{"desc":"Fresh-cut potato wedges topped with cheddar jack cheese, bacon and green onion. Served with Ranch dressing.","price":10,"new":false},"Chicken Tenders":{"desc":"Hand-battered chicken tenders, choice of dipping sauce.","price":11,"new":false},"Grouper Fingers":{"desc":"Fresh and hand-battered, with sriracha ranch.","price":10,"new":false},"Cluck Norris":{"desc":"Fresh hand-cut and battered to order. When these jumbo boneless wings cross the road, the cars look both ways. Half Pound $8 | One Pound","price":16,"new":false},"KP's Flight Log":{"desc":"When you can’t decide which burger to get, take a trip around our burger world. One of each of the following in slider form: Thelma and Bleu Cheese Louise, Jerry Garcia, Cowboy Up and California Dreamin’. Served with Fried Spuds.","price":16,"new":false}},"Mac & Cheese":{"The Saint":{"desc":"Cajun shrimp, cheddar-jack, tomatoes, scallions.","price":14,"new":false},"Shuffle off to Buffalo":{"desc":"Grilled or fried Buffalo chicken, crumbled bleu cheese and shredded mozzarella cheese.","price":14,"new":false},"Marisa Tomei":{"desc":"Mozzarella, chicken, pesto, tomatoes.","price":14,"new":false},"5 Cheese":{"desc":"Cheddar, Monterey jack, Vermont white cheddar, mozzarella, Parmesan, bread crumbs. Add grilled or fried chicken $3","price":13,"new":false},"Chicken & Broccoli":{"desc":"Broccoli, chicken, cheddar, tomato topped with toasted bread crumbs.","price":13,"new":true},"Leonardo Da Pinchi":{"desc":"Tender lump crab, shaved Vermont white cheddar, cheddar-jack, fresh tomatoes and scallions.","price":15,"new":false},"Italian Stallion":{"desc":"Shredded mozzarella, house-made meatballs and marinara served with grilled crostini.","price":13,"new":false},"The Kramer":{"desc":"Samuel Adams beer cheese Mac topped with pan fried pretzel crusted chicken breast and finished with dijon aioli, pretzel crumbs and scallions.","price":15,"new":false},"Chris P. Bacon":{"desc":"Slow-roasted pork, cheddar, Monterey jack, Vermont white cheddar, mozzarella, Parmesan, applewood smoked bacon crumbles, spicy BBQ sauce and scallions.","price":14,"new":false}},"Sandwiches":{"BLT":{"desc":"Half pound of applewood smoked bacon, lettuce, fresh sliced tomato, chipotle aioli, on grilled Vienna bread.","price":13,"new":false},"Cuba Gooding Jr.":{"desc":"Hardwood smoked ham, mesquite turkey breast, slow-roasted pulled pork, applewood smoked bacon, Swiss cheese, Dijon mustard, garlic - infused pickles on panini-pressed ciabatta.","price":14,"new":false},"Mr. Seinfeld":{"desc":"Corned beef brisket, Swiss cheese, 1000 island dressing, fresh sauerkraut on marble rye, served with pickle fries.","price":15,"new":false},"That's A Wrap":{"desc":"Grilled or fried chicken, chopped romaine, diced tomatoes, cheddar-jack cheese, buffalo sauce and either ranch or bleu cheese dressing.","price":13,"new":false},"The Doghouse":{"desc":"A short rib grilled cheese sammich with Smoked Gouda, horsey sour cream and pickled red onion. Served on grilled sourdough.","price":15,"new":false},"KPoe Boy":{"desc":"Choose either grilled Cajun or deep fried shrimp, shredded lettuce, tomato, house-made slaw, remoulade.","price":14,"new":false},"Brotherly Love":{"desc":"Philly cheesesteak, grilled onions, melted sharp cheddar, mayo on oven-baked French Bread.","price":14,"new":false},"Turkey, Apple And Brie Panini":{"desc":"Oven roasted mesquite turkey, sliced granny smith apples, melted brie, sweet cranberry chutney, fresh spinach on a grilled cuban roll.","price":14,"new":true},"Big Lebowski":{"desc":"Fresh grilled Angus ribeye, smoked gouda, white truffle aioli, swiss cheese, crispy onion straws on oven-baked ciabatta.","price":18,"new":false},"Run Chicken Run":{"desc":"Grilled or fried buttermilk chicken, applewood-smoked bacon, chipotle aioli, lettuce, fresh sliced tomato on grilled Vienna bread. Toss it in Buffalo $1","price":13,"new":false},"Bill Murray":{"desc":"House-made meatballs, marinara, mozzarella and parmesan cheeses on oven baked French bread drizzled with Parmesan peppercorn ranch.","price":13,"new":false},"Join The Club":{"desc":"A “Double Decker” of oven-roasted mesquite turkey breast, hardwood-smoked ham, cheddar and Swiss cheeses, lettuce, tomato, applewood-smoked bacon on grilled sourdough.","price":15,"new":false},"Grilled 3 Cheese Double Stack":{"desc":"Cheddar, Swiss and smoked Gouda cheeses, applewood-smoked bacon, fresh tomatoes and red onion on grilled sourdough.","price":14,"new":false}},"Signature Burgers":{"Thelma And Bleu Cheese Louise":{"desc":"Bleu cheese crumbles, peach chutney, crispy onion straws, lettuce, challah bun","price":14,"new":false},"California Dreamin'":{"desc":"Applewood-smoked bacon, avocado slices, Swiss, chipotle aioli, sliced tomato, lettuce, challah bun","price":14,"new":false},"Cowboy Up":{"desc":"Applewood-smoked bacon, cheddar, spicy BBQ sauce, onion straws, lettuce, challah bun","price":14,"new":false},"Molly Marinara":{"desc":"Sliced pepperoni, hand-cut battered provolone wedge, house-made marinara, challah bun","price":15,"new":false},"Dominach's Sidekick":{"desc":"Samuel Adams beer cheese, bacon, crispy onion straws, pretzel bun","price":15,"new":false},"Pineapple Express":{"desc":"Choice of grilled chicken or beef patty, carmelized red onions, jerk pineapple sauce, swiss cheese, grilled pineapple, lettuce, challah bun.","price":15,"new":true},"Rocky Balboa":{"desc":"Philly cheese steak, Swiss, grilled peppers and onions, dijonnaise, chipotle aioli, challah bun","price":15,"new":false},"Crew's House Burger":{"desc":"Cheddar, applewood-smoked bacon, lettuce, tomato, onion, chipotle aioli, garlic infused pickles, challah bun","price":13,"new":false},"Jerry Garcia":{"desc":"Sliced mushrooms- Swiss Ky Bourbon Ale bordelaise crispy onion straws- pretzel bun.","price":15,"new":false},"Jeff Spicoli":{"desc":"Angus beef patty, crab cake, remoulade, spring mix, tomato, challah bun.","price":15,"new":false}},"Yard Bird":{"1/4 Bird (2 pieces)":{"desc":"","price":8,"new":false},"1/2 Bird (4 pieces)":{"desc":"","price":12,"new":false},"Whole Bird":{"desc":"","price":20,"new":false}},"Knife & Fork":{"N'Awlins Cajun Pasta":{"desc":"Fettuccini pasta, cajun shrimp, andouille sausage, red and green bell peppers, cajun creole cream sauce. Served with garlic bread.","price":17,"new":false},"Zac Brown":{"desc":"Hand-battered and country fried Angus beef ribeye, dirty mashed redskin potatoes, white peppermill gravy, topped with scallions and served with choice one of side.","price":18,"new":false},"Baby Got Rack":{"desc":"Slow cooked baby back ribs dry rubbed with our special blend of house seasonings and brushed with chef’s house made BBQ sauce. Served with two sides of your choice.","price":"Half Slab $16 | Whole Slab $24","new":false},"Independence Hot Brown":{"desc":"Hardwood-smoked ham, mesquite turkey breast, applewood smoked bacon, fresh-sliced tomatoes, served open-faced on grilled sourdough, smothered in mornay sauce and topped with Vermont white cheddar","price":15,"new":false},"French Pork Chop":{"desc":"Pan seared 12oz fresh pork chop topped with a pecan compound butter. Served on a bed of our caramel sweet mashed taters with a side salad.","price":18,"new":false},"Beetlejuice":{"desc":"Boneless rib racks stacked between 2 layers of cheddar and pepperjack, grilled mac & cheese. Finished with house-made bbq and green onions.","price":18,"new":true},"Feeling Pot Roasty":{"desc":"Tender slow-braised Angus beef shoulder set atop dirty mashed redskin potatoes topped with KY Bourbon Ale Demi and steamed baby carrots. Served with a side of cornbread.","price":16,"new":false},"Hey Ma! The Meatloaf!":{"desc":"Chef’s bacon-wrapped meatloaf towers topped with KY Bourbon Ale Demi, crispy onion straws, served open-faced on grilled marble rye with dirty mashed redskin potatoes and choice of side.","price":16,"new":false},"Chicken Rosé Pasta":{"desc":"Farfalle pasta tossed in a creamy alfredo sauce, topped with marinara, chiffonade basil, and a grilled chicken breast. Served with garlic bread.","price":16,"new":false},"City Chicken":{"desc":"Skewered, breaded and pan-fried pork loin sauced with white peppermill gravy. Served with dirty mashed redskin potatoes and choice of one side.","price":15,"new":false}},"Signature Sides":{"Original Mac & Cheese":{"desc":"Five-cheese blend.","price":5,"new":false},"Cast Iron Skillet Cornbread":{"desc":"Served with honey butter.","price":5,"new":false},"Mashed Sweet Potatoes":{"desc":"Caramel sauce, candied nuts.","price":5,"new":false},"Jalapeños White Cheddar Grits":{"desc":"Vermont white cheddar, diced jalapeños.","price":5,"new":false},"Collard Greens":{"desc":"Cooked with ham and bacon.","price":5,"new":false},"Homestyle Green Beans":{"desc":"Onions, ham, bacon.","price":5,"new":false},"Side Salad":{"desc":"Fresh mixed greens, diced tomatoes, sliced red onions, croûtons, choice of dressing. Add Applewood Bacon $1, Add Hard Boiled Egg $1, Add Cheddar-Jack Cheese $1","price":5,"new":false}},"Other Side Options":{"Dirty Mashed Redskins":{"desc":"Topped with your choice of KY Bourbon Ale Demi or white peppermill gravy.","price":4,"new":false},"Fried Spuds":{"desc":"Deep fried to perfection.","price":4,"new":false},"Baked Beans":{"desc":"Topped with bacon.","price":4,"new":false},"Cole Slaw":{"desc":"House-made.","price":4,"new":false},"Hot Slaw":{"desc":"House-made Kentucky favorite.","price":4,"new":false}}},"Brunch":{"Brunch":{"Chorizo Sausage Gravy Biscuits & Eggs":{"desc":"Two southern-style biscuits served with house-made chorizo sausage gravy and two sunny side up eggs.","price":10,"new":false},"Biscuits & Gravy":{"desc":"Two southern-style biscuits smothered with house-made sausage gravy.","price":7,"new":false},"Breakfast Sausage Hash":{"desc":"Andouille sausage, sautéed red and green peppers, sautéed onions, skillet fried potatoes all topped with two eggs cooked your way. Served with toast, sour cream, and salsa.","price":15,"new":false},"Corned Beef Hash & Eggs":{"desc":"Corned beef hash topped with two cooked eggs and served with a side of Texas toast","price":13,"new":false},"French Toast":{"desc":"hand-dipped Challah bread, strawberry glaze, fresh sliced strawberries, whipped topping and served with a side of bacon or goetta.","price":15,"new":false},"Boozy Bagel French Toast":{"desc":"Makers Mark Bourbon French Toast Battered cinnamon raison bagels covered in pecan compound butter with goetta and bacon folded between each layer of bagel goodness. Topped with a sunny side up egg and served with Makers Mark infused maple syrup.","price":16,"new":false},"Belgium Pearl Sugar Waffles":{"desc":"Served with whipped cream. Add fresh sliced strawberries and strawberry glaze $3","price":7,"new":false},"Goetta Quesdilla":{"desc":"Stuffed with goetta, scrambled eggs, cheddar jack cheeses, grilled peppers and onions. Served with a side of mornay sauce for dipping.","price":12,"new":false},"South Of The Border Eggs Benedict":{"desc":"Hardwood-smoked ham between two southern style biscuits smothered in chorizo sausage gravy and topped with two sunny side up eggs. Served with fried potatoes.","price":13,"new":false},"Breakfast At Tiffany's":{"desc":"Garnished with two hand crafted sliders that include both a mini fried chicken and waffle, and a mini angus beef patty on challah both with fried hard eggs. Served on skewers with bacon, pickles, queen stuffed olives and a stalk of celery.","price":16,"new":false}},"Kids Brunch":{"French Toast Sticks":{"desc":"Served with fried potatoes and fruit cup.","price":5,"new":false},"Eggs Your Way":{"desc":"With bacon or goetta and fruit cup.","price":5,"new":false},"Waffle":{"desc":"With bacon or goetta and fruit cup.","price":5,"new":false},"Biscuits & Gravy":{"desc":"With bacon or goetta and fruit cup.","price":5,"new":false}}}}